package packageA;

public class Main {

	public static void main(String[] args) {
		/**
		 * 문제 1
		 * AA타입 객체를 10개 만들고 aa, ab에 값을 Random 객체를 사용해서 난수 1~10가 들어 가도록 한다.
		 * AB타입 객체의 리스트에 넣기.
		 */
		
		/**
		 * 문제 2
		 * 문제 1에서 들어간 AA타입 객체들을 뽑아서 멤버변수 전체 출력
		 */
		
		/**
		 * 문제 3
		 * 문제 1로 만든 AB타입 객체에서 어레이리스트 인덱스 4번의 AA객체 뽑아서 멤버변수 전체 출력
		 */
		
		/**
		 * 문제 4
		 * 문제 1에서 생성한 AA타입 객체 10개를 각각 하나씩 다른 AB타입 객체의 리스트에 넣고
		 * 이것을 다시 AC타입 객체 안의 HashMap에 넣는다.
		 */
		
		/**
		 * 문제 5
		 * 문제 4에서 생성한 AC타입 객체안에 있는 AB 객체들을 전부 꺼내고 
		 * 각 AB객체 안의 리스트에 들어있는 AA타입 객체들의 정보들을 전체 출력한다.
		 */
		
	}

}
